CREATE DATABASE  IF NOT EXISTS `mobile_classprj` /*!40100 DEFAULT CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci */ /*!80016 DEFAULT ENCRYPTION='N' */;
USE `mobile_classprj`;
-- MySQL dump 10.13  Distrib 8.0.28, for Win64 (x86_64)
--
-- Host: 127.0.0.1    Database: mobile_classprj
-- ------------------------------------------------------
-- Server version	8.0.28

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `user_timetable`
--

DROP TABLE IF EXISTS `user_timetable`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `user_timetable` (
  `userID` varchar(45) NOT NULL,
  `hour` varchar(45) DEFAULT NULL,
  `Mon` varchar(45) DEFAULT NULL,
  `Tue` varchar(45) DEFAULT NULL,
  `Wed` varchar(45) DEFAULT NULL,
  `Thu` varchar(45) DEFAULT NULL,
  `Fri` varchar(45) DEFAULT NULL,
  KEY `userID_idx` (`userID`),
  CONSTRAINT `userID` FOREIGN KEY (`userID`) REFERENCES `member` (`userID`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `user_timetable`
--

LOCK TABLES `user_timetable` WRITE;
/*!40000 ALTER TABLE `user_timetable` DISABLE KEYS */;
INSERT INTO `user_timetable` VALUES ('test','1','공강,0','모바일 프로그래밍,0','교양생활영어말하기1,0','모바일리액트,0','공강,0'),('test','2','공강,0','공강,0','공강,0','공강,0','공강,0'),('test','3','공강,0','공강,0','공강,0','공강,0','공강,0'),('test','4','공강,0','공강,0','공강,0','공강,0','공강,0'),('test','5','공강,0','공강,0','공강,0','공강,0','공강,0'),('test','6','공강,0','공강,0','공강,0','공강,0','공강,0'),('test','7','공강,0','공강,0','공강,0','공강,0','공강,0'),('test','8','공강,0','공강,0','공강,0','공강,0','공강,0'),('test1','1','공강,0','공강,0','공강,0','공강,0','공강,0'),('test1','2','공강,0','공강,0','모바일프로그래밍,0','공강,0','공강,0'),('test1','3','공강,0','공강,0','공강,0','공강,0','생활 속의 수학,0'),('test1','4','공강,0','공강,0','공강,0','캡스톤디자인1,0','공강,0'),('test1','5','공강,0','공강,0','공강,0','공강,0','공강,0'),('test1','6','공강,0','공강,0','공강,0','공강,0','현대사회와 미디어,0'),('test1','7','공강,0','공강,0','공강,0','공강,0','공강,0'),('test1','8','공강,0','공강,0','공강,0','공강,0','공강,0'),('test2','1','공강,0','공강,0','공강,0','공강,0','공강,0'),('test2','2','공강,0','공강,0','공강,0','공강,0','공강,0'),('test2','3','공강,0','공강,0','공강,0','공강,0','공강,0'),('test2','4','공강,0','공강,0','공강,0','공강,0','공강,0'),('test2','5','공강,0','공강,0','공강,0','공강,0','공강,0'),('test2','6','공강,0','공강,0','공강,0','공강,0','공강,0'),('test2','7','공강,0','공강,0','공강,0','공강,0','공강,0'),('test2','8','공강,0','공강,0','공강,0','공강,0','공강,0'),('test3','1','공강,0','공강,0','공강,0','공강,0','공강,0'),('test3','2','공강,0','공강,0','공강,0','공강,0','공강,0'),('test3','3','공강,0','공강,0','공강,0','공강,0','공강,0'),('test3','4','공강,0','공강,0','공강,0','공강,0','공강,0'),('test3','5','공강,0','공강,0','공강,0','공강,0','공강,0'),('test3','6','공강,0','공강,0','공강,0','공강,0','공강,0'),('test3','7','공강,0','공강,0','공강,0','공강,0','공강,0'),('test3','8','공강,0','공강,0','공강,0','공강,0','공강,0'),('test4','1','공강,0','공강,0','공강,0','공강,0','공강,0'),('test4','2','공강,0','공강,0','공강,0','공강,0','공강,0'),('test4','3','공강,0','공강,0','공강,0','공강,0','공강,0'),('test4','4','공강,0','공강,0','공강,0','공강,0','공강,0'),('test4','5','공강,0','공강,0','공강,0','공강,0','공강,0'),('test4','6','공강,0','공강,0','공강,0','공강,0','공강,0'),('test4','7','공강,0','공강,0','공강,0','공강,0','공강,0'),('test4','8','공강,0','공강,0','공강,0','공강,0','공강,0'),('test10','1','공강,0','공강,0','공강,0','공강,0','공강,0'),('test10','2','공강,0','공강,0','공강,0','공강,0','공강,0'),('test10','3','공강,0','공강,0','공강,0','공강,0','공강,0'),('test10','4','공강,0','공강,0','공강,0','공강,0','공강,0'),('test10','5','공강,0','공강,0','공강,0','공강,0','공강,0'),('test10','6','공강,0','공강,0','공강,0','공강,0','공강,0'),('test10','7','공강,0','공강,0','공강,0','공강,0','공강,0'),('test10','8','공강,0','공강,0','공강,0','공강,0','공강,0'),('test11','1','공강,0','공강,0','공강,0','공강,0','공강,0'),('test11','2','공강,0','공강,0','공강,0','공강,0','공강,0'),('test11','3','공강,0','공강,0','공강,0','공강,0','공강,0'),('test11','4','공강,0','공강,0','공강,0','공강,0','공강,0'),('test11','5','공강,0','공강,0','공강,0','공강,0','공강,0'),('test11','6','공강,0','공강,0','공강,0','공강,0','공강,0'),('test11','7','공강,0','공강,0','공강,0','공강,0','공강,0'),('test11','8','공강,0','공강,0','공강,0','공강,0','공강,0'),('happy','1','공강,0','공강,0','공강,0','공강,0','공강,0'),('happy','2','공강,0','공강,0','공강,0','공강,0','공강,0'),('happy','3','공강,0','공강,0','공강,0','공강,0','모바일프로그래밍,0'),('happy','4','공강,0','공강,0','공강,0','공강,0','공강,0'),('happy','5','공강,0','공강,0','공강,0','공강,0','공강,0'),('happy','6','공강,0','공강,0','공강,0','공강,0','공강,0'),('happy','7','공강,0','공강,0','공강,0','공강,0','공강,0'),('happy','8','공강,0','공강,0','공강,0','공강,0','공강,0'),('happy1','1','공강,0','공강,0','공강,0','공강,0','공강,0'),('happy1','2','공강,0','공강,0','공강,0','공강,0','공강,0'),('happy1','3','공강,0','공강,0','공강,0','공강,0','공강,0'),('happy1','4','공강,0','공강,0','공강,0','공강,0','공강,0'),('happy1','5','공강,0','공강,0','공강,0','공강,0','공강,0'),('happy1','6','공강,0','공강,0','공강,0','공강,0','공강,0'),('happy1','7','공강,0','공강,0','공강,0','공강,0','공강,0'),('happy1','8','공강,0','공강,0','공강,0','공강,0','공강,0'),('hello','1','공강,0','공강,0','공강,0','공강,0','공강,0'),('hello','2','공강,0','공강,0','공강,0','공강,0','공강,0'),('hello','3','공강,0','공강,0','공강,0','공강,0','공강,0'),('hello','4','공강,0','공강,0','공강,0','공강,0','공강,0'),('hello','5','공강,0','공강,0','공강,0','공강,0','공강,0'),('hello','6','공강,0','공강,0','공강,0','공강,0','공강,0'),('hello','7','공강,0','공강,0','공강,0','공강,0','공강,0'),('hello','8','공강,0','공강,0','공강,0','공강,0','공강,0'),('hello1','1','공강,0','공강,0','공강,0','공강,0','공강,0'),('hello1','2','공강,0','공강,0','공강,0','공강,0','공강,0'),('hello1','3','공강,0','공강,0','공강,0','공강,0','공강,0'),('hello1','4','공강,0','공강,0','공강,0','공강,0','공강,0'),('hello1','5','공강,0','공강,0','공강,0','공강,0','공강,0'),('hello1','6','공강,0','공강,0','공강,0','공강,0','공강,0'),('hello1','7','공강,0','공강,0','공강,0','공강,0','공강,0'),('hello1','8','공강,0','공강,0','공강,0','공강,0','공강,0'),('nice','1','공강,0','공강,0','공강,0','공강,0','공강,0'),('nice','2','공강,0','공강,0','공강,0','공강,0','공강,0'),('nice','3','공강,0','공강,0','공강,0','공강,0','공강,0'),('nice','4','공강,0','공강,0','공강,0','공강,0','공강,0'),('nice','5','공강,0','공강,0','공강,0','공강,0','공강,0'),('nice','6','공강,0','공강,0','공강,0','공강,0','공강,0'),('nice','7','공강,0','공강,0','공강,0','공강,0','공강,0'),('nice','8','공강,0','공강,0','공강,0','공강,0','공강,0'),('nice1','1','공강,0','공강,0','공강,0','공강,0','공강,0'),('nice1','2','공강,0','공강,0','공강,0','모바일프로그래밍,0','공강,0'),('nice1','3','공강,0','공강,0','공강,0','공강,0','공강,0'),('nice1','4','공강,0','공강,0','공강,0','공강,0','공강,0'),('nice1','5','공강,0','공강,0','공강,0','공강,0','공강,0'),('nice1','6','공강,0','공강,0','공강,0','공강,0','공강,0'),('nice1','7','공강,0','공강,0','공강,0','공강,0','공강,0'),('nice1','8','공강,0','공강,0','공강,0','공강,0','공강,0');
/*!40000 ALTER TABLE `user_timetable` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2022-12-10 20:27:03
